In [2]:
# 数据的导入
import pandas as pd
df = pd.read_csv('data/scores.csv')
display(df)
# 数据的导出
df.to_csv('data/new_scores.csv')

   Unnamed: 0  姓名  数学  英语  物理   总分
0           0  张三  85  90  75  250
1           1  李四  92  88  80  260
2           2  王五  78  85  88  251
3           3  周六  88  92  85  265
4           4  李七  95  80  90  265

In [3]:
df = pd.read_json('data/sites.json')
df

     id    name             url  likes
0  A001    菜鸟教程  www.runoob.com     61
1  A002  Google  www.google.com    124
2  A003      淘宝  www.taobao.com     45

In [4]:
import json

with open('data/nested_list.json') as f:
    data = json.load(f)
    # print(data['students'])
df = pd.DataFrame(data['students'])
df

     id   name  math  physics  chemistry
0  A001    Tom    60       66         61
1  A002  James    89       76         51
2  A003  Jenny    79       90         78

In [5]:
import pandas as pd

df = pd.read_csv('data/nba.csv')
# print(df.to_string()) # 显示全部数据
display(df.head())
print(df.isna().sum(axis=0))  # 统计缺失值总数
# df.head()
# display(df.fillna({'College':'kansan','Age':'23'}).tail()) # 字典填充缺失值
# display(df.fillna(df[['Age','Salary']].median()).head())    # 使用统计值填充
# display(df.ffill().tail())  # front 用前面的相邻值填充
# display(df.bfill().head())  # behind 用后面的相邻值填充

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

Name         1
Team         1
Number       1
Position     1
Age          1
Height       1
Weight       1
College     85
Salary      12
dtype: int64

In [6]:
# DataFrame.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)
# axis:默认为0, 表示逢空值剔除整行，如果设置参数 axis＝1 表示逢空值去掉整列
# how:默认为 'any' 如果一行（或一列）里任何一个数据有出现 NA 就去掉整行, 如果设置 how='all' 一行（或列）都是 NA 才去掉这整行
# thresh:设置需要多少非空值的数据才可以保留下来的
# subset:设置想要检查的列.如果是多个列, 可以使用列名的 list 作为参数。
# inplace:如果设置True, 将计算得到的值直接覆盖之前的值并返回 None, 修改的是源数据
df.duplicated()  # 整条记录一样, 标记为重复, 返回True
df.drop_duplicates()  # 删除重复记录
df.drop_duplicates(subset=['Name'])  # 根据指定列去重
df.drop_duplicates(subset=['Name'], keep='last')  # 保留最后一次出现的

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [7]:
df = pd.read_csv('data/nba.csv')
print(df.dtypes)
print('*' * 20)
# 数据类型转换
df['Age'] = df['Age'].fillna(0).astype('int16')
df.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object
********************

Name         object
Team         object
Number      float64
Position     object
Age           int16
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [12]:
df = pd.DataFrame(
    {
        'name': ['Tom', 'Jack', 'Alice', 'Lucy'],
        'age': [20, 22, 21, 24],
        'gender': ['male', 'male', 'female', 'female'],
        'score': [71, 62.5, 80, 86]
    }, index=[1, 2, 3, 4], columns=['name', 'age', 'gender', 'score']
)
print(df)
df['gender'] = df['gender'].astype('category')  # 分类
# df['gender'].value_counts()
df.gender

    name  age  gender  score
1    Tom   20    male   71.0
2   Jack   22    male   62.5
3  Alice   21  female   80.0
4   Lucy   24  female   86.0

1      male
2      male
3    female
4    female
Name: gender, dtype: category
Categories (2, object): ['female', 'male']

In [9]:
data = {
    '姓名': ['张三', '李四', '王五'],
    '数学': [85, 92, 78],
    '英语': [90, 88, 85],
    '物理': [75, 80, 88]
}
scores = pd.DataFrame(data)
print(scores)
# 宽表转换成长表
scores_melt = pd.melt(scores, id_vars=['姓名'], var_name='科目', value_name='成绩')
scores_melt.sort_values('姓名')

   姓名  数学  英语  物理
0  张三  85  90  75
1  李四  92  88  80
2  王五  78  85  88

   姓名  科目  成绩
0  张三  数学  85
3  张三  英语  90
6  张三  物理  75
1  李四  数学  92
4  李四  英语  88
7  李四  物理  80
2  王五  数学  78
5  王五  英语  85
8  王五  物理  88

In [10]:
# 长表转宽表
pd.pivot(scores_melt, index=['姓名'], columns='科目', values='成绩')

科目  数学  物理  英语
姓名
张三  85  75  90
李四  92  80  88
王五  78  88  85

In [11]:
data = {
    'id': [1, 2],
    'name': ['Alice smith', 'Bob smith'],
    'Math': [90, 85],
    'English': [88, 92],
    'Science': [95, 89]
}
df = pd.DataFrame(data)
# 分列
df[['first_name', 'last_name']] = df['name'].str.split(' ', expand=True)
df

   id         name  Math  English  Science first_name last_name
0   1  Alice smith    90       88       95      Alice     smith
1   2    Bob smith    85       92       89        Bob     smith